evaluation/synthetic/two-services/move-timer-read-microbenchmark/s1_no_rlock_d100-poker100000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=100
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_POKER_BATCH_THRESHOLD=100000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   213.89ms   18.43ms 344.98ms   92.72%
    Req/Sec   292.11     57.67   400.00     81.78%
  Latency Distribution
     50%  214.23ms
     75%  217.79ms
     90%  221.96ms
     99%  282.58ms
  6920 requests in 3.03s, 2.77MB read
Requests/sec:   2280.94
Transfer/sec:      0.91MB
[run.sh] Speed is 2280.94, duration is 26
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d26s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
Running 26s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   216.44ms   18.94ms 397.31ms   95.49%
    Req/Sec   295.31     71.35     0.94k    73.36%
  Latency Distribution
     50%  216.49ms
     75%  220.55ms
     90%  224.88ms
     99%  268.42ms
  40000 requests in 26.00s, 15.98MB read
Requests/sec:   1538.45
Transfer/sec:    629.50KB
------------------------------
stop time: 16.730840
stop time: 16.827190
stop time: 17.067525
stop time: 17.066100
stop time: 17.102322
stop time: 17.113458
stop time: 17.132671
stop time: 17.148655
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-7ffd8f6ff6-4jwqs        801m         46Mi            
service1-5cfdf49cbc-b4mxj        1157m        12Mi            
ubuntu-client-76886f6bbd-29292   39m          10Mi            
[run.sh] Test finished with status 0

40000 / ( ( 16.730840 + 16.827190 + 17.067525 + 17.066100 + 17.102322 + 17.113458 + 17.132671 + 17.148655 ) / 8 ) = 2,349.679941651

2000000 / 2,349.679941651 = 851.17975625