evaluation/synthetic/two-services/move-timer-read-microbenchmark/s1_no_rlockd_500-poker60000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=500
SLOWPOKE_DELAY_MICROS_SERVICE0=0
SLOWPOKE_POKER_BATCH_THRESHOLD=60000000
PROCESSING_TIME_SERVICE0=0.0002
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   391.26ms  124.79ms 984.35ms   81.25%
    Req/Sec   152.32     47.69   270.00     71.31%
  Latency Distribution
     50%  370.01ms
     75%  408.46ms
     90%  573.05ms
     99%  783.84ms
  3615 requests in 3.03s, 1.44MB read
Requests/sec:   1192.59
Transfer/sec:    487.98KB
[run.sh] Speed is 1192.59, duration is 50
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d50s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
[run.sh] Checking the resource usage
NAME                             CPU(cores)   MEMORY(bytes)   
service0-78dc7965b9-7tqb4        588m         45Mi            
service1-df9755b9d-m4m5c         744m         15Mi            
ubuntu-client-76886f6bbd-shxrl   40m          13Mi            
Running 50s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   406.70ms  125.78ms   1.47s    84.09%
    Req/Sec   156.86     42.33   590.00     67.40%
  Latency Distribution
     50%  372.28ms
     75%  405.98ms
     90%  594.31ms
     99%  812.63ms
  40000 requests in 50.00s, 15.98MB read
Requests/sec:    800.00
Transfer/sec:    327.34KB
------------------------------
stop time: 31.795926
stop time: 32.084094
stop time: 31.900629
stop time: 31.908559
stop time: 32.100911
stop time: 31.984562
stop time: 32.096224
stop time: 32.247591
[run.sh] Test finished with status 0